
#+title: Strompreise
#+author: jakoboss

#+begin_src python :results output :session a :exports both :tangle yes  
# preis_pro_kwh = 30.93
preis_pro_kwh = 43.48
preis_pro_wh = preis_pro_kwh / 1000

print(f"preis pro watt stunde = {preis_pro_wh}")

#+end_src

#+RESULTS:
: preis pro watt stunde = 0.04348

* Licht
https://www.mediamarkt.de/de/content/themen-specials/schon-gewusst-wie/led-stromverbrauch-berechnen
Die meisten LED-Lampen haben einen Stromverbrauch von 6 bis 9 Watt pro Stunde.

#+begin_src python :results output :session a :exports both :tangle yes
min_wh = 6
max_wh = 9

min_month_wh = min_wh * 30
max_month_wh = max_wh * 30

print(f"preis für jeden tag eine stunde pro monat min = {min_month_wh * preis_pro_wh / 100} €")
print(f"preis für jeden tag eine stunde pro monat max = {max_month_wh * preis_pro_wh / 100} €")
#+end_src

#+RESULTS:
: preis für jeden tag eine stunde pro monat min = 0.078264 €
: preis für jeden tag eine stunde pro monat max = 0.117396 €



* Waschmaschine
https://www.entega.de/blog/stromverbrauch-waschmaschine/
Im Mittel verbrauchen die meisten Waschmaschinen jährlich etwa 200 kWh Strom


#+begin_src python :results output :session a :exports both :tangle yes
avg_kwh_pa = 200 
avg_kwh_pm = avg_kwh_pa / 12 


print(f"preis pro monat für waschen min = {avg_kwh_pm * preis_pro_kwh / 100} €")
#+end_src

#+RESULTS:
: preis pro monat für waschen min = 7.246666666666666 €

* Kühlschrank
https://www.coolblue.nl/en/advice/energy-consumption-fridge.html

#+begin_src python :results output :session a :exports both :tangle yes
min_kwh_pa = 109
max_kwh_pa = 253

min_kwh_pm = min_kwh_pa / 12
max_kwh_pm = max_kwh_pa / 12


print(f"preis pro kühlschrank pro monat min = {min_kwh_pm * preis_pro_kwh / 100} €")
print(f"preis pro kühlschrank pro monat max = {max_kwh_pm * preis_pro_kwh / 100} €")
#+end_src

#+RESULTS:
: preis pro kühlschrank pro monat min = 3.9494333333333334 €
: preis pro kühlschrank pro monat max = 9.167033333333332 €

* Wasserkocher
https://www.co2online.de/energie-sparen/strom-sparen/strom-sparen-stromspartipps/wasserkocher/
pro liter wasser 0,12 kWh 

#+begin_src python :results output :session a :exports both :tangle yes
avg_kwh_pl = 0.12


print(f"preis für 1 liter wasser im wasserkocher kochen = {avg_kwh_pl * preis_pro_kwh / 100} €")
#+end_src

#+RESULTS:
: preis für 1 liter wasser im wasserkocher kochen = 0.05217599999999999 €
